{
	"@metadata": {
		"authors": [
			"Dreamy Jazz",
			"Ellen Rayfield",
			"Essex Igyan",
			"Julia Kieserman"
		]
	},
	"reportincident-desc": "{{desc|name=ReportIncident|url=https://www.mediawiki.org/wiki/Extension:ReportIncident}}",
	"reportincident-report-btn-label": "The text for the report button.",
	"reportincident-dialog-close-btn": "The tooltip text for the close button on the Report Incident dialog\n{{Identical|Close}}",
	"reportincident-dialog-proceed-btn": "The text for the button to move from the information page to the form submission page.",
	"reportincident-dialog-back-btn": "The text for the button to move back from the form submission step to the information step in the Reporting dialog.\n{{Identical|Back}}",
	"reportincident-dialog-submit-btn": "The text for the button to submit a report.\n{{Identical|Submit}}",
	"reportincident-dialog-title": "The title for the report incident dialog.",
	"reportincident-dialog-first-step-cancel-btn": "The text for the button to cancel filing a report.",
	"reportincident-dialog-harassment-type-label": "Label for multiple choice field that allows the user to specify what inappropriate behavior has occurred.",
	"reportincident-dialog-additional-details-input-label": "Label for additional details input on report form",
	"reportincident-dialog-additional-details-input-placeholder": "Placeholder text for additional details input on report form",
	"reportincident-dialog-optional-label": "Text used to indicate that a field is optional on the report form with parentheses wrapping the word.",
	"reportincident-dialog-violator-label": "Label for who is being reported input on report form",
	"reportincident-dialog-violator-placeholder-text": "Placeholder text for the field where a user enters the user they are reporting.",
	"reportincident-dialog-harassment-type-hate-speech-or-discrimination": "Label for type of harassment: Hate speech or discrimination",
	"reportincident-dialog-harassment-type-sexual-harassment": "Label for type of harassment: Sexual harassment",
	"reportincident-dialog-harassment-type-threats-of-violence": "Label for type of harassment: Threats of violence",
	"reportincident-dialog-harassment-type-intimidation": "Label for type of harassment: Intimidation, aggression, name calling",
	"reportincident-dialog-harassment-type-something-else": "Label for type of harassment: Something else. If selected a extra box appears for the user to enter free text to describe the something else.",
	"reportincident-dialog-something-else-input-placeholder": "Placeholder text for the 'Something else' text input that is shown when a user has selected the 'Something else' harassment type.",
	"reportincident-dialog-harassment-intro-text": "A message about the wiki's stance on inappropriate behavior, including harassment.",
	"reportincident-dialog-harassment-lead-in-to-harassment-examples": "Lead-in to a list of not tolerated behaviors on the wiki.",
	"reportincident-dialog-harassment-example-insults": "Insults, as an example of behavior not tolerated on Wikipedia",
	"reportincident-dialog-harassment-example-sexual-harassment": "Sexual harassment, as an example of behavior not tolerated on Wikipedia",
	"reportincident-dialog-harassment-example-threats": "Threats, as an example of behavior not tolerated on Wikipedia",
	"reportincident-dialog-harassment-example-encouraging-harm": "Encouraging harm to others, as an example of behavior not tolerated on Wikipedia",
	"reportincident-dialog-harassment-example-doxing": "Doxing (disclosure of personal data), as an example of behavior not tolerated on Wikipedia",
	"reportincident-dialog-harassment-example-hounding": "Hounding, as an example of behavior not tolerated on Wikipedia",
	"reportincident-dialog-harassment-example-trolling": "Trolling, as an example of behavior not tolerated on Wikipedia",
	"reportincident-dialog-engage-header": "Header for text explaining how to engage in dialog",
	"reportincident-dialog-engage-text": "Information shown on step 1 of the reporting dialog that explains how a user could communicate directly with the user to resolve the issue if they feel comfortable with this.",
	"reportincident-dialog-admin-review": "Explains who will review the submitted report and provides a link to a page that describes these users.\nParameters:\n* $1 - The page name of the page that describes these users.",
	"reportincident-dialog-harassment-empty": "Error message shown to the user when they have not selected one of the items in the behavior list.",
	"reportincident-dialog-violator-empty": "Error message shown to the user when they have not specified the user they are reporting.",
	"reportincident-dialog-something-else-empty": "Error message shown to the user when they have not specified anything in the 'Something else' textbox.",
	"reportincident-unable-to-send": "Error message sent back via the REST API if emailing an incident report fails.",
	"reportincident-email-subject": "Email subject line for reports sent to moderators. Parameters:\n* $1 - the username of the user who filed the report.",
	"reportincident-email-body": "Email body for reports sent to moderators. Parameters:\n* $1 - The username of the user who filed the report.\n* $2 - the username of the user being reported.\n* $3 - The link to the revision of the page, at the time the report was filed.\n* $4 - a comma-separated list of behaviors defined in the form.\n* $5 - additional text supplied by the reporter\n* $6 - a link to Special:EmailUser for the user with username in $1",
	"reportincident-email-something-else": "Value of the freetext \"something else\" list in an emailed report to moderators.\nParameters:\n* $1 - The text supplied by the user in the \"something else\" field.",
	"right-reportincident": "{{doc-right|reportincident}}",
	"action-reportincident": "{{doc-action|reportincident}}",
	"reportincident-emaildialog-title": "Title to show in dialog when user does not have a verified email address",
	"reportincident-emaildialog-close-button": "Text to show in button label to close dialog, when user does not have a verified email address.",
	"reportincident-emaildialog-content": "Text to show in content region of a dialog shown when user does not have a verified email addres.",
	"reportincident-emaildialog-primary": "Text to show in button label for primary action in dialog shown when user does not have a verified email address.",
	"reportincident-confirmedemail-required": "Message to show in API response when user submits an API request without a confirmed email."
}
